{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "А": 4,
      "а": 5,
      "Б": 6,
      "б": 7,
      "В": 8,
      "в": 9,
      "Г": 10,
      "г": 11,
      "Д": 12,
      "д": 13,
      "Е": 14,
      "е": 15,
      "Ё": 16,
      "ё": 17,
      "Ж": 18,
      "ж": 19,
      "З": 20,
      "з": 21,
      "И": 22,
      "и": 23,
      "Й": 24,
      "й": 25,
      "К": 26,
      "к": 27,
      "Л": 28,
      "л": 29,
      "М": 30,
      "м": 31,
      "Н": 32,
      "н": 33,
      "О": 34,
      "о": 35,
      "П": 36,
      "п": 37,
      "Р": 38,
      "р": 39,
      "С": 40,
      "с": 41,
      "Т": 42,
      "т": 43,
      "У": 44,
      "у": 45,
      "Ф": 46,
      "ф": 47,
      "Х": 48,
      "х": 49,
      "Ц": 50,
      "ц": 51,
      "Ч": 52,
      "ч": 53,
      "Ш": 54,
      "ш": 55,
      "Щ": 56,
      "щ": 57,
      "Ъ": 58,
      "ъ": 59,
      "Ы": 60,
      "ы": 61,
      "Ь": 62,
      "ь": 63,
      "Э": 64,
      "э": 65,
      "Ю": 66,
      "ю": 67,
      "Я": 68,
      "я": 69,
      "Ѣ": 70,
      "ѣ": 71,
      "Ѳ": 72,
      "ѳ": 73,
      "І": 74,
      "і": 75,
      "Ѵ": 76,
      "ѵ": 77,
      "I": 78,
      "i": 79,
      "V": 80,
      "v": 81,
      "X": 82,
      "x": 83,
      "L": 84,
      "l": 85,
      "C": 86,
      "c": 87,
      "D": 88,
      "d": 89,
      "M": 90,
      "m": 91,
      "0": 92,
      "1": 93,
      "2": 94,
      "3": 95,
      "4": 96,
      "5": 97,
      "6": 98,
      "7": 99,
      "8": 100,
      "9": 101,
      ".": 102,
      ",": 103,
      ":": 104,
      ";": 105,
      "!": 106,
      "?": 107,
      "\"": 108,
      "'": 109,
      "(": 110,
      ")": 111,
      "[": 112,
      "]": 113,
      "{": 114,
      "}": 115,
      "-": 116,
      "–": 117,
      "—": 118,
      "«": 119,
      "»": 120,
      "/": 121,
      "\\": 122,
      "@": 123,
      "#": 124,
      "%": 125,
      "&": 126,
      "*": 127,
      "№": 128,
      "•": 129,
      "·": 130,
      "…": 131,
      "+": 132,
      "=": 133,
      "|": 134,
      "_": 135,
      " ": 136
    },
    "unk_token": "[UNK]"
  }
}