{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "А": 4,
      "а": 5,
      "Б": 6,
      "б": 7,
      "В": 8,
      "в": 9,
      "Г": 10,
      "г": 11,
      "Д": 12,
      "д": 13,
      "Е": 14,
      "е": 15,
      "Ё": 16,
      "ё": 17,
      "Ж": 18,
      "ж": 19,
      "З": 20,
      "з": 21,
      "И": 22,
      "и": 23,
      "Й": 24,
      "й": 25,
      "К": 26,
      "к": 27,
      "Л": 28,
      "л": 29,
      "М": 30,
      "м": 31,
      "Н": 32,
      "н": 33,
      "О": 34,
      "о": 35,
      "П": 36,
      "п": 37,
      "Р": 38,
      "р": 39,
      "С": 40,
      "с": 41,
      "Т": 42,
      "т": 43,
      "У": 44,
      "у": 45,
      "Ф": 46,
      "ф": 47,
      "Х": 48,
      "х": 49,
      "Ц": 50,
      "ц": 51,
      "Ч": 52,
      "ч": 53,
      "Ш": 54,
      "ш": 55,
      "Щ": 56,
      "щ": 57,
      "Ъ": 58,
      "ъ": 59,
      "Ы": 60,
      "ы": 61,
      "Ь": 62,
      "ь": 63,
      "Э": 64,
      "э": 65,
      "Ю": 66,
      "ю": 67,
      "Я": 68,
      "я": 69,
      "І": 70,
      "і": 71,
      "Ѣ": 72,
      "ѣ": 73,
      "Ѳ": 74,
      "ѳ": 75,
      "Ѵ": 76,
      "ѵ": 77,
      "Ѡ": 78,
      "ѡ": 79,
      "Ѧ": 80,
      "ѧ": 81,
      "Ѩ": 82,
      "ѩ": 83,
      "Ѫ": 84,
      "ѫ": 85,
      "Ѭ": 86,
      "ѭ": 87,
      "Ѯ": 88,
      "ѯ": 89,
      "Ѱ": 90,
      "ѱ": 91,
      "Ѿ": 92,
      "ѿ": 93,
      "Ѹ": 94,
      "ѹ": 95,
      "Ѻ": 96,
      "ѻ": 97,
      "Ꙋ": 98,
      "ꙋ": 99,
      "Ѷ": 100,
      "ѷ": 101,
      "Ѽ": 102,
      "ѽ": 103,
      "Ҁ": 104,
      "ҁ": 105,
      "0": 106,
      "1": 107,
      "2": 108,
      "3": 109,
      "4": 110,
      "5": 111,
      "6": 112,
      "7": 113,
      "8": 114,
      "9": 115,
      "I": 116,
      "V": 117,
      "X": 118,
      "L": 119,
      "C": 120,
      "D": 121,
      "M": 122,
      "i": 123,
      "v": 124,
      "x": 125,
      "l": 126,
      "c": 127,
      "d": 128,
      "m": 129,
      ".": 130,
      ",": 131,
      ":": 132,
      ";": 133,
      "!": 134,
      "?": 135,
      "\"": 136,
      "'": 137,
      "(": 138,
      ")": 139,
      "[": 140,
      "]": 141,
      "{": 142,
      "}": 143,
      "-": 144,
      "–": 145,
      "—": 146,
      "«": 147,
      "»": 148,
      "/": 149,
      "\\": 150,
      "@": 151,
      "#": 152,
      "%": 153,
      "&": 154,
      "*": 155,
      "№": 156,
      "•": 157,
      " ": 158
    },
    "unk_token": "[UNK]"
  }
}